article/34.postgres-quickstart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-16 Sun 22:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Postgres 快速使用</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">Postgres 快速使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcac7f4f">1. 常用命令速查</a>
<ul>
<li><a href="#org11eef9b">1.1. 查看数据库基本信息</a></li>
<li><a href="#org111aa56">1.2. 数据库相关的操作命令</a></li>
<li><a href="#orgb831beb">1.3. 用户信息相关的操作命令</a></li>
<li><a href="#org59d999e">1.4. 表相关的操作命令</a></li>
<li><a href="#org05d9c73">1.5. 数据备份与还原</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgcac7f4f" class="outline-2">
<h2 id="orgcac7f4f"><span class="section-number-2">1</span> 常用命令速查</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org11eef9b" class="outline-3">
<h3 id="org11eef9b"><span class="section-number-3">1.1</span> 查看数据库基本信息</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#25152;&#26377;&#29992;&#25143;&#21015;&#34920;:</span>
<span style="color: #859900;">SELECT</span> rolname <span style="color: #859900;">FROM</span> pg_roles;
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#24403;&#21069;&#29992;&#25143;:</span>
<span style="color: #859900;">SELECT</span> <span style="color: #859900;">current_user</span>;
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#24403;&#21069;&#29992;&#25143;&#26435;&#38480;</span>
<span style="color: #d33682;">\du</span>
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#25152;&#26377;&#25968;&#25454;&#24211;&#21015;&#34920;</span>
<span style="color: #d33682;">\l</span>
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#24403;&#21069;&#25968;&#25454;&#24211;</span>
<span style="color: #859900;">SELECT</span> current_database();
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#24403;&#21069;&#25968;&#25454;&#24211;&#30340;&#25152;&#26377;&#34920;</span>
<span style="color: #d33682;">\dt</span>
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#20989;&#25968;&#21015;&#34920;</span>
<span style="color: #d33682;">\df &lt;schema&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org111aa56" class="outline-3">
<h3 id="org111aa56"><span class="section-number-3">1.2</span> 数据库相关的操作命令</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #586e75; font-style: italic;">-- &#36830;&#25509;&#25968;&#25454;&#24211;</span>
<span style="color: #d33682;">\c &lt;database_name&gt;</span>
<span style="color: #586e75; font-style: italic;">-- &#21019;&#24314;&#25968;&#25454;&#24211;</span>
<span style="color: #859900;">CREATE</span> <span style="color: #6c71c4;">DATABASE</span> &lt;database_name&gt; <span style="color: #859900;">WITH</span> <span style="color: #6c71c4;">OWNER</span> &lt;username&gt;;
<span style="color: #586e75; font-style: italic;">-- &#21024;&#38500;&#25968;&#25454;&#24211;</span>
<span style="color: #6c71c4;">DROP</span> <span style="color: #6c71c4;">DATABASE</span> <span style="color: #6c71c4;">IF</span> <span style="color: #6c71c4;">EXISTS</span> &lt;database_name&gt;;
<span style="color: #586e75; font-style: italic;">-- &#37325;&#21629;&#21517;&#25968;&#25454;&#24211;</span>
<span style="color: #6c71c4;">ALTER</span> <span style="color: #6c71c4;">DATABASE</span> &lt;old_name&gt; <span style="color: #6c71c4;">RENAME</span> <span style="color: #859900;">TO</span> &lt;new_name&gt;;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb831beb" class="outline-3">
<h3 id="orgb831beb"><span class="section-number-3">1.3</span> 用户信息相关的操作命令</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#25152;&#26377;&#29992;&#25143;</span>
<span style="color: #859900;">SELECT</span> rolname <span style="color: #859900;">FROM</span> pg_roles;
<span style="color: #586e75; font-style: italic;">-- &#21019;&#24314;&#29992;&#25143;</span>
<span style="color: #859900;">CREATE</span> <span style="color: #859900;">USER</span> &lt;user_name&gt; <span style="color: #859900;">WITH</span> <span style="color: #6c71c4;">PASSWORD</span> <span style="color: #2aa198;">'&lt;password&gt;'</span>;
<span style="color: #586e75; font-style: italic;">-- &#21024;&#38500;&#29992;&#25143;</span>
<span style="color: #6c71c4;">DROP</span> <span style="color: #859900;">USER</span> <span style="color: #6c71c4;">IF</span> <span style="color: #6c71c4;">EXISTS</span> &lt;user_name&gt;;
<span style="color: #586e75; font-style: italic;">-- &#20462;&#25913;&#29992;&#25143;&#23494;&#30721;</span>
<span style="color: #6c71c4;">ALTER</span> <span style="color: #6c71c4;">ROLE</span> &lt;user_name&gt; <span style="color: #859900;">WITH</span> <span style="color: #6c71c4;">PASSWORD</span> <span style="color: #2aa198;">'&lt;password&gt;'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org59d999e" class="outline-3">
<h3 id="org59d999e"><span class="section-number-3">1.4</span> 表相关的操作命令</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#25152;&#26377;&#34920;</span>
<span style="color: #d33682;">\dt</span>
<span style="color: #586e75; font-style: italic;">-- &#26597;&#30475;&#20840;&#23616;&#30340;&#34920;</span>
<span style="color: #d33682;">\dt *.*</span>
<span style="color: #586e75; font-style: italic;">-- &#21019;&#24314;&#34920;</span>
<span style="color: #859900;">CREATE</span> <span style="color: #859900;">TABLE</span> &lt;<span style="color: #6c71c4;">table_name</span>&gt; (
  &lt;<span style="color: #6c71c4;">column_name</span>&gt; &lt;column_type&gt;,
  &lt;<span style="color: #6c71c4;">column_name</span>&gt; &lt;column_type&gt;,
  &lt;<span style="color: #6c71c4;">column_name</span>&gt; &lt;column_type&gt;
);

<span style="color: #586e75; font-style: italic;">-- &#21019;&#24314;&#29992;&#25143;&#34920;&#30340;&#20363;&#23376;</span>
<span style="color: #859900;">CREATE</span> <span style="color: #6c71c4;">SEQUENCE</span> <span style="color: #b58900;">global_id</span>
  <span style="color: #6c71c4;">INCREMENT</span> <span style="color: #6c71c4;">BY</span> 1
  <span style="color: #6c71c4;">MINVALUE</span> 1 <span style="color: #6c71c4;">NO</span> <span style="color: #6c71c4;">MAXVALUE</span>
  <span style="color: #6c71c4;">START</span> <span style="color: #859900;">WITH</span> 9999;

<span style="color: #859900;">CREATE</span> <span style="color: #859900;">TABLE</span> <span style="color: #b58900;">users</span> (
  <span style="color: #6c71c4;">id</span> <span style="color: #268bd2;">INT</span> <span style="color: #859900;">PRIMARY</span> <span style="color: #6c71c4;">KEY</span> <span style="color: #859900;">NOT</span> <span style="color: #859900;">NULL</span> <span style="color: #859900;">DEFAULT</span> NEXTVAL(<span style="color: #2aa198;">'global_id'</span>),
  code <span style="color: #268bd2;">VARCHAR</span>(32), <span style="color: #586e75; font-style: italic;">-- data is invalid when code is NULL</span>
  created_at <span style="color: #268bd2;">TIMESTAMP</span> <span style="color: #6c71c4;">WITHOUT</span> <span style="color: #268bd2;">TIME</span> <span style="color: #6c71c4;">ZONE</span> <span style="color: #859900;">NOT</span> <span style="color: #859900;">NULL</span> <span style="color: #859900;">DEFAULT</span> <span style="color: #859900;">CURRENT_TIMESTAMP</span>,
  updated_at <span style="color: #268bd2;">TIMESTAMP</span> <span style="color: #6c71c4;">WITHOUT</span> <span style="color: #268bd2;">TIME</span> <span style="color: #6c71c4;">ZONE</span> <span style="color: #859900;">NOT</span> <span style="color: #859900;">NULL</span> <span style="color: #859900;">DEFAULT</span> <span style="color: #859900;">CURRENT_TIMESTAMP</span>,
  username <span style="color: #268bd2;">VARCHAR</span>(64) <span style="color: #859900;">NOT</span> <span style="color: #859900;">NULL</span>,
  nickname <span style="color: #268bd2;">VARCHAR</span>(64),
  <span style="color: #6c71c4;">password</span> <span style="color: #268bd2;">VARCHAR</span>(128),
  birthday <span style="color: #268bd2;">DATE</span>,
  <span style="color: #859900;">CONSTRAINT</span> unique_username <span style="color: #859900;">UNIQUE</span> (username)
);
<span style="color: #6c71c4;">ALTER</span> <span style="color: #859900;">TABLE</span> <span style="color: #b58900;">users</span> <span style="color: #6c71c4;">OWNER</span> <span style="color: #859900;">TO</span> &lt;tabowner_name&gt;;
<span style="color: #6c71c4;">COMMENT</span> <span style="color: #859900;">ON</span> <span style="color: #859900;">TABLE</span> users <span style="color: #859900;">IS</span> <span style="color: #2aa198;">'&#29992;&#25143;&#34920;'</span>;
<span style="color: #6c71c4;">COMMENT</span> <span style="color: #859900;">ON</span> <span style="color: #859900;">COLUMN</span> users.username <span style="color: #859900;">IS</span> <span style="color: #2aa198;">'&#29992;&#25143;&#30331;&#24405;&#30340;&#29992;&#25143;&#21517;'</span>;
<span style="color: #6c71c4;">COMMENT</span> <span style="color: #859900;">ON</span> <span style="color: #859900;">COLUMN</span> users.nickname <span style="color: #859900;">IS</span> <span style="color: #2aa198;">'&#29992;&#25143;&#26165;&#31216;'</span>;

<span style="color: #586e75; font-style: italic;">-- &#21024;&#38500;&#34920;</span>
<span style="color: #6c71c4;">DROP</span> <span style="color: #859900;">TABLE</span> <span style="color: #6c71c4;">IF</span> <span style="color: #6c71c4;">EXISTS</span> &lt;<span style="color: #6c71c4;">table_name</span>&gt; <span style="color: #6c71c4;">CASCADE</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org05d9c73" class="outline-3">
<h3 id="org05d9c73"><span class="section-number-3">1.5</span> 数据备份与还原</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-shell">-- &#22791;&#20221;&#25968;&#25454;&#24211;
pg_dump &lt;database_name&gt;
-- &#36824;&#21407;&#25968;&#25454;&#24211;
pg_restore -d &lt;database_name&gt; -a &lt;file_pathway&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">-- &#23548;&#20986; csv &#25991;&#20214;
\copy &lt;table_name&gt; TO <span style="color: #2aa198;">'&lt;file_path&gt;'</span> CSV;
-- &#23548;&#20837; csv &#25991;&#20214;
\copy &lt;table_name&gt; FROM <span style="color: #2aa198;">'&lt;file_path&gt;'</span> CSV;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-06-16 Sun 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-06-16 Sun 22:06</p>
<p class="validation"></p>
</div>
</body>
</html>
